In [59]:
import pandas as pd

# Create a dictionary with three keys, 'A', 'B', and 'C', and lists of 10 numbers as values
data = {'A': list(range(10)),
        'B': list(range(10, 20)),
        'C': list(range(20, 30))}

# Convert the dictionary to a pandas DataFrame
df1 = pd.DataFrame(data)

# Print the DataFrame
df = df1.head()
df

   A   B   C
0  0  10  20
1  1  11  21
2  2  12  22
3  3  13  23
4  4  14  24

In [60]:
df.count()

A    5
B    5
C    5
dtype: int64

In [61]:
df.A.count()

5

In [62]:
df

   A   B   C
0  0  10  20
1  1  11  21
2  2  12  22
3  3  13  23
4  4  14  24

In [63]:
df

   A   B   C
0  0  10  20
1  1  11  21
2  2  12  22
3  3  13  23
4  4  14  24

In [64]:
df

   A   B   C
0  0  10  20
1  1  11  21
2  2  12  22
3  3  13  23
4  4  14  24

In [65]:
x = pd.Series([7, 7, 7])

In [66]:
df =pd.concat([df, x], ignore_index = True)

In [67]:
df

     A     B     C    0
0  0.0  10.0  20.0  NaN
1  1.0  11.0  21.0  NaN
2  2.0  12.0  22.0  NaN
3  3.0  13.0  23.0  NaN
4  4.0  14.0  24.0  NaN
5  NaN   NaN   NaN  7.0
6  NaN   NaN   NaN  7.0
7  NaN   NaN   NaN  7.0